#+title: 减肥记录
#+date: 2025-01-19T19:50:02+01:00
#+lastmod: 2025-01-19T19:50:02+01:00
# ISO 8601 date use output from
# C-u M-! date -Iseconds
#+draft: false
#+tags[]:

记录自己减肥的进度。包含跑步统计和饮食统计。身体瘦比好吃的食物更舒服。

# more
* 目标
身高179厘米的目标是64公斤。这个目标对应BMI=20.0。


* 跑步

我争取每天跑七公里，用时45分钟。跑步是使用手表和GadgetBridge记录的。

| 日期             | 里程 公里 | 体重 公斤 |
|------------------+-----------+-----------|
| <2025-01-19 Sun> |     142.6 |      72.5 |
| <2025-01-20 Mon> |     149.9 |      72.5 |

* 饮食

** Org 模式表格编辑

用 =C-c }= 显示表格调试模式。

在修改计算函数后，在表格内用 =C-u C-c *= 来重新计算结果。

** 目标、数据来源

每日摄入参考数据来源 https://www.nal.usda.gov/human-nutrition-and-food-safety/dri-calculator

| 性别 | 年龄 岁 | 身高 厘米 | BMI20体重 公斤 | 运动量 | 热量 千卡 | 热量 千焦 | 碳水 克 | 蛋白 克 | 脂肪 克 | 水 升 |
|------+---------+-----------+----------------+--------+-----------+-----------+---------+---------+---------+-------|
| 男   |      50 |       172 |             59 | 少     |      2163 |      9049 |     300 |      48 |      48 |   3.7 |
| 男   |      25 |       179 |             63 | 少     |      2534 |     10602 |     330 |      50 |      56 |   3.7 |
| 女   |      50 |       165 |             54 | 少     |      1811 |      7577 |     250 |      43 |      40 |   2.7 |
#+TBLFM: $7=(floor ($6 4.184))

食品数据来源 https://fdc.nal.usda.gov/

| 食品     | 单位 | 热量 千焦 | 碳水 克 | 蛋白 克 | 脂肪 克 | 用量 | 摄入热量 千焦 | 摄入碳水 克 | 摄入蛋白 克 | 摄入脂肪 克 |
|----------+------+-----------+---------+---------+---------+------+---------------+-------------+-------------+-------------|
| 生大米   | 百克 |      1548 |      80 |       7 |       1 |    0 |             0 |           0 |           0 |           0 |
| 土豆     | 百克 |       305 |      16 |       1 |       0 |    0 |             0 |           0 |           0 |           0 |
| 小麦面粉 | 百克 |      1548 |      74 |      12 |       1 |    0 |             0 |           0 |           0 |           0 |
| 生豆角   | 百克 |       129 |       6 |       1 |       0 |    0 |             0 |           0 |           0 |           0 |
| 生茄子   | 百克 |       108 |       5 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 白菜     | 百克 |       129 |       6 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 全麦面条 | 百克 |      1405 |      64 |      13 |       2 |    0 |             0 |           0 |           0 |           0 |
| 白糖     | 百克 |      1677 |      99 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 瓜子油   | 百克 |      3700 |       0 |       0 |      93 |    0 |             0 |           0 |           0 |           0 |
| 小扁豆   | 百克 |      1506 |      62 |      23 |       1 |    0 |             0 |           0 |           0 |           0 |
| 去壳鸡蛋 | 百克 |       615 |       0 |      12 |      10 |    0 |             0 |           0 |           0 |           0 |
| 萝卜     | 百克 |       188 |      10 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 苹果     | 百克 |       255 |      15 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 香蕉     | 百克 |       410 |      23 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 西瓜     | 百克 |       125 |       7 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 洋葱     | 百克 |       150 |       7 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 全脂牛奶 | 百克 |       255 |       5 |       3 |       3 |    0 |             0 |           0 |           0 |           0 |
| 全脂酸奶 | 百克 |       326 |       6 |       4 |       5 |    0 |             0 |           0 |           0 |           0 |
| 橙子     | 百克 |       217 |      11 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 新食品   | 百克 |       836 |     100 |     100 |     100 |    0 |             0 |           0 |           0 |           0 |
|----------+------+-----------+---------+---------+---------+------+---------------+-------------+-------------+-------------|
| 总计     |      |           |         |         |         |      |             0 |           0 |           0 |           0 |
| 每日目标 |      |           |         |         |         |      |         10602 |         330 |          50 |          56 |
#+TBLFM: @<<$8..@>>>$8=($3 $7)::@<<$9..@>>>$9=($4 $7)::@<<$10..@>>>$10=($5 $7)::@<<$11..@>>>$11=($6 $7)::@>>$8=vsum(@I$8..@II$8)::@>>$9=vsum(@I$9..@II$9)::@>>$10=vsum(@I$10..@II$10)::@>>$11=vsum(@I$11..@II$11)


# comment:
# @>$5=vsum(@I$5..@II$5)
# @> refers to the last row, $5 refers to the fifth col
# @I..@II refers to the region between first hline and second hline
# @I$5..@II$5 refers to the region of fifth col between first hline and second hline

# @<<$5..@>>$5=($3 $4)
# @<<..@>> refers to the region between third line and third to last line.
# excluding first and last two lines.

#+begin_src elisp
  (defun org-table-my-delete-row ()
    (interactive)
    (save-excursion
      (unless (org-at-table-p)
        (error "You are not in an org-table."))
      (goto-char (org-table-begin))
      ;; skip first two header rows
      (forward-line)
      (forward-line)
      (while (and (org-at-table-p) (not (org-at-table-hline-p)))
        (if (= 0 (string-to-number (save-excursion (org-table-get-field 7))))
            (delete-region (point) (progn (forward-line) (point)))
          (forward-line)))))
#+end_src


*** 空表

| 食品     | 单位 | 热量 千焦 | 碳水 克 | 蛋白 克 | 脂肪 克 | 用量 | 摄入热量 千焦 | 摄入碳水 克 | 摄入蛋白 克 | 摄入脂肪 克 |
|----------+------+-----------+---------+---------+---------+------+---------------+-------------+-------------+-------------|
| 生大米   | 百克 |      1548 |      80 |       7 |       1 |    0 |             0 |           0 |           0 |           0 |
| 土豆     | 百克 |       305 |      16 |       1 |       0 |    0 |             0 |           0 |           0 |           0 |
| 小麦面粉 | 百克 |      1548 |      74 |      12 |       1 |    0 |             0 |           0 |           0 |           0 |
| 生豆角   | 百克 |       129 |       6 |       1 |       0 |    0 |             0 |           0 |           0 |           0 |
| 生茄子   | 百克 |       108 |       5 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 白菜     | 百克 |       129 |       6 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 全麦面条 | 百克 |      1405 |      64 |      13 |       2 |    0 |             0 |           0 |           0 |           0 |
| 白糖     | 百克 |      1677 |      99 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 瓜子油   | 百克 |     15480 |       0 |       0 |      93 |    0 |             0 |           0 |           0 |           0 |
| 小扁豆   | 百克 |      1506 |      62 |      23 |       1 |    0 |             0 |           0 |           0 |           0 |
| 去壳鸡蛋 | 百克 |       615 |       0 |      12 |      10 |    0 |             0 |           0 |           0 |           0 |
| 萝卜     | 百克 |       188 |      10 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 苹果     | 百克 |       255 |      15 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 香蕉     | 百克 |       410 |      23 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 西瓜     | 百克 |       125 |       7 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 洋葱     | 百克 |       150 |       7 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 全脂牛奶 | 百克 |       255 |       5 |       3 |       3 |    0 |             0 |           0 |           0 |           0 |
| 全脂酸奶 | 百克 |       326 |       6 |       4 |       5 |    0 |             0 |           0 |           0 |           0 |
| 橙子     | 百克 |       217 |      11 |       0 |       0 |    0 |             0 |           0 |           0 |           0 |
| 新食品   | 百克 |       836 |     100 |     100 |     100 |    0 |             0 |           0 |           0 |           0 |
|----------+------+-----------+---------+---------+---------+------+---------------+-------------+-------------+-------------|
| 总计     |      |           |         |         |         |      |             0 |           0 |           0 |           0 |
| 每日目标 |      |           |         |         |         |      |         10602 |         330 |          50 |          56 |
#+TBLFM: @<<$8..@>>>$8=($3 $7)::@<<$9..@>>>$9=($4 $7)::@<<$10..@>>>$10=($5 $7)::@<<$11..@>>>$11=($6 $7)::@>>$8=vsum(@I$8..@II$8)::@>>$9=vsum(@I$9..@II$9)::@>>$10=vsum(@I$10..@II$10)::@>>$11=vsum(@I$11..@II$11)

** 二五年一月

*** <2025-01-19 Sun>
| 食品   | 单位 | 单位kJ | 用量 |  用量kJ |
|--------+------+--------+------+---------|
| 半熟米 | 百克 |   1485 |  4.5 |  6682.5 |
| 土豆   | 百克 |    364 |    3 |    1092 |
| 干豆类 | 百克 |   1514 |    1 |    1514 |
| 白菜   | 百克 |    103 |    5 |     515 |
| 瓜子油 | 百ml |   3400 |  0.6 |   2040. |
|--------+------+--------+------+---------|
| 总计   |      |        |      | 11843.5 |
#+TBLFM: @<<$5..@>>$5=($3 $4);::@>$5=vsum(@I$5..@II$5);

*** <2025-01-20 Mon>
| 食品   | 单位 | 单位kJ | 用量 | 用量kJ |
|--------+------+--------+------+--------|
| 半熟米 | 百克 |   1485 |  3.5 | 5197.5 |
| 土豆   | 百克 |    364 |    6 |   2184 |
| 白菜   | 百克 |    103 |    5 |    515 |
| 瓜子油 | 百ml |   3400 |  0.4 |  1360. |
|--------+------+--------+------+--------|
| 总计   |      |        |      | 9256.5 |
#+TBLFM: @<<$5..@>>$5=($3 $4);::@>$5=vsum(@I$5..@II$5);

*** <2025-01-21 Tue>
| 食品   | 单位 | 单位kJ | 用量 | 用量kJ |
|--------+------+--------+------+--------|
| 土豆   | 百克 |    364 |   10 |   3640 |
| 干豆类 | 百克 |   1514 |    1 |   1514 |
| 白菜   | 百克 |    103 |    5 |    515 |
| 瓜子油 | 十克 |    370 |    5 |   1850 |
|--------+------+--------+------+--------|
| 总计   |      |        |      |   7519 |
#+TBLFM: @<<$5..@>>$5=($3 $4);::@>$5=vsum(@I$5..@II$5);

*** <2025-01-22 Wed>
| 食品           | 单位 | 单位kJ | 用量 | 用量kJ |
|----------------+------+--------+------+--------|
| 全麦面条       | 百克 |   1422 |    4 |   5688 |
| 香蕉去皮       | 百克 |    371 |    3 |   1113 |
| 油浸金枪鱼罐头 | 百克 |    603 |    2 |   1206 |
|----------------+------+--------+------+--------|
| 总计           |      |        |      |   8007 |
#+TBLFM: @<<$5..@>>$5=($3 $4);::@>$5=vsum(@I$5..@II$5);
一根带皮香蕉175克。因为没有秤，估计去皮香蕉每根150克。


*** 空表

| 食品     | 单位 | 热量 千焦 | 碳水 克 | 蛋白 克 | 脂肪 克 | 用量 | 摄入热量 千焦 | 摄入碳水 克 | 摄入蛋白 克 | 摄入脂肪 克 |
|----------+------+-----------+---------+---------+---------+------+---------------+-------------+-------------+-------------|
| 土豆     | 百克 |       305 |      16 |       1 |       0 |    7 |          2135 |         112 |           7 |           0 |
| 瓜子油   | 百克 |      3700 |       0 |       0 |      93 |  0.4 |         1480. |          0. |          0. |        37.2 |
| 小扁豆   | 百克 |      1506 |      62 |      23 |       1 |    1 |          1506 |          62 |          23 |           1 |
| 去壳鸡蛋 | 百克 |       615 |       0 |      12 |      10 |  1.5 |         922.5 |          0. |         18. |         15. |
| 苹果     | 百克 |       255 |      15 |       0 |       0 |    3 |           765 |          45 |           0 |           0 |
| 香蕉     | 百克 |       410 |      23 |       0 |       0 |  4.5 |         1845. |       103.5 |          0. |          0. |
| 橙子     | 百克 |       217 |      11 |       0 |       0 |  2.8 |         607.6 |        30.8 |          0. |          0. |
|----------+------+-----------+---------+---------+---------+------+---------------+-------------+-------------+-------------|
| 总计     |      |           |         |         |         |      |        9261.1 |       353.3 |         48. |        53.2 |
| 每日目标 |      |           |         |         |         |      |         10602 |         330 |          50 |          56 |
#+TBLFM: @<<$8..@>>>$8=($3 $7)::@<<$9..@>>>$9=($4 $7)::@<<$10..@>>>$10=($5 $7)::@<<$11..@>>>$11=($6 $7)::@>>$8=vsum(@I$8..@II$8)::@>>$9=vsum(@I$9..@II$9)::@>>$10=vsum(@I$10..@II$10)::@>>$11=vsum(@I$11..@II$11)

一根带皮香蕉175克。因为没有秤，估计去皮香蕉每根150克。
14个苹果2公斤。估计一个苹果150克。
16个橙子3公斤。估计一个橙子190克。
两个去壳鸡蛋估计为100克。
